RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sar2.c
/***************************************************************************//**
* \file cy_sar2.c
* \version 1.0
*
* Provides API implementation of the SAR2 Driver.
*
*******************************************************************************
* \copyright
* (c) (2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation. All rights reserved.
*******************************************************************************
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_sar2.h"

#if defined (CY_IP_MXS40EPASS_ESAR)

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 6, \
'Checked manually. Type cast to int8_t made intentionally.');

#define GET_SFLASH_VALUE(x)                     CY_GET_REG16(x)
#define GET_TRIM_VALUE(x)                       (GET_SFLASH_VALUE(x) & 0xFFFFu)

#define CY_SAR2_DIODE_COLD(t)  (((t) == CY_SAR2_VDDA_2_7V_TO_4_5V) ? \
 (SFLASH->EPASS_TEMP_TRIM_DIODE_COLDSORT) : (SFLASH->EPASS_TEMP_TRIM_DIODE_COLDSORT_5V))

#define CY_SAR2_DIODE_ROOM(t)  (((t) == CY_SAR2_VDDA_2_7V_TO_4_5V) ? \
 (SFLASH->EPASS_TEMP_TRIM_DIODE_ROOMSORT) : (SFLASH->EPASS_TEMP_TRIM_DIODE_ROOMSORT_5V))

#define CY_SAR2_DIODE_HOT(t)  (((t) == CY_SAR2_VDDA_2_7V_TO_4_5V) ? \
 (SFLASH->EPASS_TEMP_TRIM_DIODE_HOTCLASS) : (SFLASH->EPASS_TEMP_TRIM_DIODE_HOTCLASS_5V))

 #define CY_SAR2_VBG_COLD(t)  (((t) == CY_SAR2_VDDA_2_7V_TO_4_5V) ? \
 (SFLASH->EPASS_TEMP_TRIM_VBG_COLDSORT) : (SFLASH->EPASS_TEMP_TRIM_VBG_COLDSORT_5V))

 #define CY_SAR2_VBG_ROOM(t)  (((t) == CY_SAR2_VDDA_2_7V_TO_4_5V) ? \
 (SFLASH->EPASS_TEMP_TRIM_VBG_ROOMSORT) : (SFLASH->EPASS_TEMP_TRIM_VBG_ROOMSORT_5V))

 #define CY_SAR2_VBG_HOT(t)  (((t) == CY_SAR2_VDDA_2_7V_TO_4_5V) ? \
 (SFLASH->EPASS_TEMP_TRIM_VBG_HOTCLASS) : (SFLASH->EPASS_TEMP_TRIM_VBG_HOTCLASS_5V))

typedef struct {
    double      hotValue;   /**< The PASS hot temperature reading */
    double      roomValue;  /**< The PASS  room temperature reading */
    double      coldValue;  /**< The PASS  cold temperature reading */
} cy_stc_sar2_temp_sflash_data_t;


/*******************************************************************************
* Function Name: Cy_SAR2_Init
****************************************************************************//**
*
* Initializes the SAR2 block.
*
* \param base
* The pointer to the SAR ADC block instance.
*
* \param config
* The pointer to the configuration structure \ref cy_stc_sar2_config_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_Init(PASS_SAR_Type * base, const cy_stc_sar2_config_t * config)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    if ((NULL != config) && (NULL != base))
    {
        base->PRECOND_CTL = _VAL2FLD(PASS_SAR_PRECOND_CTL_PRECOND_TIME, config->preconditionTime);

        base->CTL = (_VAL2FLD(PASS_SAR_CTL_PWRUP_TIME, config->powerupTime) |
                    _BOOL2FLD(PASS_SAR_CTL_IDLE_PWRDWN, config->enableIdlePowerDown) |
                    _BOOL2FLD(PASS_SAR_CTL_MSB_STRETCH, config->msbStretchMode) |
                    _BOOL2FLD(PASS_SAR_CTL_HALF_LSB, config->enableHalfLsbConv) |
                    _BOOL2FLD(PASS_SAR_CTL_SARMUX_EN, config->sarMuxEnable) |
                    _BOOL2FLD(PASS_SAR_CTL_ADC_EN, config->adcEnable) |
                    _BOOL2FLD(PASS_SAR_CTL_ENABLED, config->sarIpEnable));

        for (uint8_t chan = 0u; chan < CY_SAR2_CHAN_NUM(base); chan++)
        {
            const cy_stc_sar2_channel_config_t * locChanCfg = config->channelConfig[chan];

            if (NULL != locChanCfg)
            {
                (void) Cy_SAR2_Channel_Init(base, chan, locChanCfg);
            }
        }
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_Init
****************************************************************************//**
*
* Initializes an SAR channel.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \param channelConfig
* The pointer to the configuration structure \ref cy_stc_sar2_channel_config_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_Channel_Init(PASS_SAR_Type * base, uint32_t channel,
                                                                     const cy_stc_sar2_channel_config_t * channelConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    CY_ASSERT_L1(NULL != channelConfig);
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    if (CY_SAR2_CHAN_NUM_VALID(base, channel))
    {
        /* First, disable the channel */
        Cy_SAR2_Channel_Disable(base, channel);

        /* Clear the whole interrupt flags */
        Cy_SAR2_Channel_ClearInterrupt(base, channel, CY_SAR2_INTR);

        SAR2_CH_TR_CTL(base, channel) =
                        (_VAL2FLD(PASS_SAR_CH_TR_CTL_SEL, channelConfig->triggerSelection) |
                        _VAL2FLD(PASS_SAR_CH_TR_CTL_PRIO, channelConfig->channelPriority) |
                        _VAL2FLD(PASS_SAR_CH_TR_CTL_PREEMPT_TYPE, channelConfig->preenptionType) |
                        _BOOL2FLD(PASS_SAR_CH_TR_CTL_GROUP_END, channelConfig->isGroupEnd) |
                        _BOOL2FLD(PASS_SAR_CH_TR_CTL_DONE_LEVEL, channelConfig->doneLevel));

        SAR2_CH_SAMPLE_CTL(base, channel) =
                            (_VAL2FLD(PASS_SAR_CH_SAMPLE_CTL_PIN_ADDR, channelConfig->pinAddress) |
                            _VAL2FLD(PASS_SAR_CH_SAMPLE_CTL_PORT_ADDR, channelConfig->portAddress) |
                            _VAL2FLD(PASS_SAR_CH_SAMPLE_CTL_EXT_MUX_SEL, channelConfig->extMuxSelect) |
                            _BOOL2FLD(PASS_SAR_CH_SAMPLE_CTL_EXT_MUX_EN, channelConfig->extMuxEnable) |
                            _VAL2FLD(PASS_SAR_CH_SAMPLE_CTL_PRECOND_MODE, channelConfig->preconditionMode) |
                            _VAL2FLD(PASS_SAR_CH_SAMPLE_CTL_OVERLAP_DIAG, channelConfig->overlapDiagMode) |
                            _VAL2FLD(PASS_SAR_CH_SAMPLE_CTL_SAMPLE_TIME, channelConfig->sampleTime) |
                            _VAL2FLD(PASS_SAR_CH_SAMPLE_CTL_ALT_CAL, channelConfig->calibrationValueSelect));

        SAR2_CH_POST_CTL(base, channel) =
                            (_VAL2FLD(PASS_SAR_CH_POST_CTL_POST_PROC, channelConfig->postProcessingMode) |
                            _VAL2FLD(PASS_SAR_CH_POST_CTL_LEFT_ALIGN, channelConfig->resultAlignment) |
                            _VAL2FLD(PASS_SAR_CH_POST_CTL_SIGN_EXT, channelConfig->signExtention) |
                            _VAL2FLD(PASS_SAR_CH_POST_CTL_RANGE_MODE, channelConfig->rangeDetectionMode));

        if((channelConfig->postProcessingMode == CY_SAR2_POST_PROCESSING_MODE_AVG) ||
            (channelConfig->postProcessingMode == CY_SAR2_POST_PROCESSING_MODE_AVG_RANGE))
        {
            SAR2_CH_POST_CTL(base, channel) |=
                            (_VAL2FLD(PASS_SAR_CH_POST_CTL_AVG_CNT, (channelConfig->averageCount - 1UL)) |
                            _VAL2FLD(PASS_SAR_CH_POST_CTL_SHIFT_R, channelConfig->rightShift));
        }
        else if (channelConfig->postProcessingMode == CY_SAR2_POST_PROCESSING_MODE_RANGE_PULSE)
        {
            SAR2_CH_POST_CTL(base, channel) |=
                            (_VAL2FLD(PASS_SAR_CH_POST_CTL_AVG_CNT, channelConfig->positiveReload) |
                            _VAL2FLD(PASS_SAR_CH_POST_CTL_SHIFT_R, channelConfig->negativeReload));
        }
        else if (channelConfig->postProcessingMode == CY_SAR2_POST_PROCESSING_MODE_NONE)
        {
            SAR2_CH_POST_CTL(base, channel) |=
                            (_VAL2FLD(PASS_SAR_CH_POST_CTL_SHIFT_R, channelConfig->rightShift));
        }
        else
        {
            /* Do not configure post processing options */
        }

