RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sar2.c
        SAR2_CH_RANGE_CTL(base, channel) =
                            (_VAL2FLD(PASS_SAR_CH_RANGE_CTL_RANGE_LO, channelConfig->rangeDetectionLoThreshold) |
                            _VAL2FLD(PASS_SAR_CH_RANGE_CTL_RANGE_HI, channelConfig->rangeDetectionHiThreshold));

        if (channelConfig->channelHwEnable)
        {
            Cy_SAR2_Channel_Enable(base, channel);
        }

        Cy_SAR2_Channel_SetInterruptMask(base, channel, channelConfig->interruptMask);
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_DeInit
****************************************************************************//**
*
* Stops and de-initializes the SAR channel register.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
*******************************************************************************/
void Cy_SAR2_Channel_DeInit(PASS_SAR_Type * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    SAR2_CH_TR_CTL(base, channel) = 0x800UL; /* TR_CTL default value */
    Cy_SAR2_Channel_Disable(base, channel);

    /* Clear interrupt mask */
    Cy_SAR2_Channel_SetInterruptMask(base, channel, 0UL);
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_GetResult
****************************************************************************//**
*
* Returns the conversion result and status.
*
* \param base
* The pointer to an SAR instance.
*
* \param channel
* The channel number.
*
* \param status
* The pointer that will return measurement status bits ORed. The pointer can be
* NULL, then, s status is not returned.
*
* \return Conversion result.
*
*******************************************************************************/
uint16_t Cy_SAR2_Channel_GetResult(PASS_SAR_Type * base, uint32_t channel, uint32_t * status)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    uint32_t value = base->CH[channel].RESULT;

    if (NULL != status)
    {
        *status = value & (PASS_SAR_CH_RESULT_ABOVE_HI_MIR_Msk |
                          PASS_SAR_CH_RESULT_RANGE_INTR_MIR_Msk |
                          PASS_SAR_CH_RESULT_PULSE_INTR_MIR_Msk |
                          PASS_SAR_CH_RESULT_VALID_MIR_Msk);
    }

    return (uint16_t)_FLD2VAL(PASS_SAR_CH_RESULT_RESULT, value);
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_GetWorkingData
****************************************************************************//**
*
* Returns the working data and status.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \param status
* The pointer that will return measurement status bits ORed. The pointer can be
* NULL, then, a status is not returned.
*
* \return Conversion result.
*
*******************************************************************************/
uint16_t Cy_SAR2_Channel_GetWorkingData(PASS_SAR_Type * base, uint32_t channel, uint32_t * status)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    uint32_t value = base->CH[channel].WORK;

    if (NULL != status)
    {
        *status = value & (PASS_SAR_CH_RESULT_ABOVE_HI_MIR_Msk |
                          PASS_SAR_CH_RESULT_RANGE_INTR_MIR_Msk |
                          PASS_SAR_CH_RESULT_PULSE_INTR_MIR_Msk |
                          PASS_SAR_CH_RESULT_VALID_MIR_Msk);
    }

    return (uint16_t)_FLD2VAL(PASS_SAR_CH_RESULT_RESULT, value);
}

/*******************************************************************************
* Function Name: Cy_SAR2_Diag_Init
****************************************************************************//**
*
* Initializes the diagnosis function.
*
* \param base
* The pointer to the SAR instance.
*
* \param diagConfig
* The pointer to the configuration structure \ref cy_stc_sar2_diag_config_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_Diag_Init(PASS_SAR_Type * base, const cy_stc_sar2_diag_config_t * diagConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    if (NULL != diagConfig)
    {
        base->DIAG_CTL = _CLR_SET_FLD32U(base->DIAG_CTL, PASS_SAR_DIAG_CTL_DIAG_SEL, diagConfig->referenceSelect);
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_SetDigitalCalibrationValue
****************************************************************************//**
*
* Configure SAR ADC digital calibration value.
*
* \param base
* The pointer to the SAR instance.
*
* \param digCalibConfig
* The pointer to the configuration structure
* \ref cy_stc_sar2_digital_calibration_config_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_SetDigitalCalibrationValue(PASS_SAR_Type * base,
                                                      const cy_stc_sar2_digital_calibration_config_t * digCalibConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_BAD_PARAM;

    if (NULL != digCalibConfig)
    {
        base->DIG_CAL = (_VAL2FLD(PASS_SAR_DIG_CAL_DOFFSET, digCalibConfig->offset) |
                         _VAL2FLD(PASS_SAR_DIG_CAL_DGAIN, digCalibConfig->gain));
        ret = CY_SAR2_SUCCESS;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetDigitalCalibrationValue
****************************************************************************//**
*
* Gets the SAR ADC digital calibration value.
*
* \param base
* The pointer to the SAR instance.
*
* \param digCalibConfig
* The pointer to the output configuration structure
* \ref cy_stc_sar2_digital_calibration_config_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_GetDigitalCalibrationValue(PASS_SAR_Type * base,
                                                      cy_stc_sar2_digital_calibration_config_t * digCalibConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

