RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sar2.c
    uint32_t digCal = base->DIG_CAL;
    if (NULL != digCalibConfig)
    {
        digCalibConfig->offset = (uint16_t) _FLD2VAL(PASS_SAR_DIG_CAL_DOFFSET, digCal);
        digCalibConfig->gain   = (int8_t) _FLD2VAL(PASS_SAR_DIG_CAL_DGAIN, digCal);
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_SetAltDigitalCalibrationValue
****************************************************************************//**
*
* Configures an alternate SAR digital calibration value.
*
* \param base
* The pointer to the SAR instance.
*
* \param altDigCalibConfig
* The pointer to the configuration structure
* \ref cy_stc_sar2_digital_calibration_config_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_SetAltDigitalCalibrationValue(PASS_SAR_Type * base,
                                                     const cy_stc_sar2_digital_calibration_config_t * altDigCalibConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    if (NULL != altDigCalibConfig)
    {
        base->DIG_CAL_ALT = (_VAL2FLD(PASS_SAR_DIG_CAL_ALT_DOFFSET, altDigCalibConfig->offset) |
                         _VAL2FLD(PASS_SAR_DIG_CAL_ALT_DGAIN, altDigCalibConfig->gain));
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetAltDigitalCalibrationValue
****************************************************************************//**
*
* Gets an alternate SAR digital calibration value.
*
* \param base
* The pointer to the SAR instance.
*
* \param altDigCalibConfig
* The utput pointer to the configuration structure
* \ref cy_stc_sar2_digital_calibration_config_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_GetAltDigitalCalibrationValue(PASS_SAR_Type * base,
                                                         cy_stc_sar2_digital_calibration_config_t * altDigCalibConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    uint32_t digCalAlt = base->DIG_CAL_ALT;
    if (NULL != altDigCalibConfig)
    {
        altDigCalibConfig->offset = (uint16_t) _FLD2VAL(PASS_SAR_DIG_CAL_ALT_DOFFSET, digCalAlt);
        altDigCalibConfig->gain   = (int8_t) _FLD2VAL(PASS_SAR_DIG_CAL_ALT_DGAIN, digCalAlt);
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_SetAnalogCalibrationValue
****************************************************************************//**
*
* Configures an SAR analog calibration value.
*
* \param base
* The pointer to the SAR instance.
*
* \param analogCalibConfig
* The pointer to the configuration structure
* \ref cy_stc_sar2_analog_calibration_conifg_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_SetAnalogCalibrationValue(PASS_SAR_Type * base,
                                                     cy_stc_sar2_analog_calibration_conifg_t * analogCalibConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    if (NULL != analogCalibConfig)
    {
        base->ANA_CAL = (_VAL2FLD(PASS_SAR_ANA_CAL_AOFFSET, analogCalibConfig->offset) |
                         _VAL2FLD(PASS_SAR_ANA_CAL_AGAIN, analogCalibConfig->gain));
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetAnalogCalibrationValue
****************************************************************************//**
*
* Gets an SAR analog calibration value.
*
* \param base
* The pointer to the SAR instance.
*
* \param analogCalibConfig
* The utput pointer to the configuration structure
* \ref cy_stc_sar2_analog_calibration_conifg_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_GetAnalogCalibrationValue(PASS_SAR_Type * base,
                                                     cy_stc_sar2_analog_calibration_conifg_t * analogCalibConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    uint32_t anaCal = base->ANA_CAL;
    if (NULL != analogCalibConfig)
    {
        analogCalibConfig->offset = (int8_t) _FLD2VAL(PASS_SAR_ANA_CAL_AOFFSET, anaCal);
        analogCalibConfig->gain   = (int8_t) _FLD2VAL(PASS_SAR_ANA_CAL_AGAIN, anaCal);
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_SetAltAnalogCalibrationValue
****************************************************************************//**
*
* Configures an alternate SAR analog calibration value.
*
* \param base
* The pointer to the SAR instance.
*
* \param altAnalogCalibConfig
* The pointer to the configuration structure
* \ref cy_stc_sar2_analog_calibration_conifg_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_SetAltAnalogCalibrationValue(PASS_SAR_Type * base,
                                                        cy_stc_sar2_analog_calibration_conifg_t * altAnalogCalibConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    if (NULL != altAnalogCalibConfig)
    {
        base->ANA_CAL_ALT = (_VAL2FLD(PASS_SAR_ANA_CAL_ALT_AOFFSET, altAnalogCalibConfig->offset) |
                             _VAL2FLD(PASS_SAR_ANA_CAL_ALT_AGAIN, altAnalogCalibConfig->gain));
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetAltAnalogCalibrationValue
****************************************************************************//**
*
* Gets an alternate SAR analog calibration value.
*
* \param base
* The pointer to the SAR instance.
*
* \param altAnalogCalibConfig
* The utput pointer to the configuration structure
* \ref cy_stc_sar2_analog_calibration_conifg_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_GetAltAnalogCalibrationValue(PASS_SAR_Type * base,
                                                        cy_stc_sar2_analog_calibration_conifg_t * altAnalogCalibConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    uint32_t altAnaCal = base->ANA_CAL_ALT;
    if (NULL != altAnalogCalibConfig)
    {
        altAnalogCalibConfig->offset = (int8_t) _FLD2VAL(PASS_SAR_ANA_CAL_AOFFSET, altAnaCal);
        altAnalogCalibConfig->gain   = (int8_t) _FLD2VAL(PASS_SAR_ANA_CAL_AGAIN, altAnaCal);
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

