RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sar2.c
/*******************************************************************************
* Function Name: Cy_SAR2_SetDebugFreezeMode
****************************************************************************//**
*
* Configures the debug pause feature.
*
* \param base
* The pointer to the PASS instance.
*
* \param debConfig
* The utput pointer to the configuration structure
* \ref cy_stc_sar2_debug_freeze_config_t.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_SetDebugFreezeMode(PASS_EPASS_MMIO_Type * base,
                                              const cy_stc_sar2_debug_freeze_config_t * debConfig)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    uint32_t temp = 0UL;
    if (NULL != debConfig)
    {
        temp |= (debConfig->enableFreezeAdc0) ? 1UL : 0UL;
        temp |= (debConfig->enableFreezeAdc1) ? 2UL : 0UL;
        temp |= (debConfig->enableFreezeAdc2) ? 4UL : 0UL;
        temp |= (debConfig->enableFreezeAdc3) ? 8UL : 0UL;
        base->PASS_CTL = _CLR_SET_FLD32U(base->PASS_CTL, PASS_EPASS_MMIO_PASS_CTL_DBG_FREEZE_EN, temp);
    }
    else
    {
        ret = CY_SAR2_BAD_PARAM;
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_SetGenericTriggerInput
****************************************************************************//**
*
* Configures the generic trigger input selection.
*
* \param base
* The pointer to the PASS instance.
*
* \param numOfAdc
* The ADC channel number.
*
* \param triggerInputNumber
* The generic input trigger number to be set up.
*
* \param genericTriggerValue
* The generic input trigger to be used as a corresponding trigger input #.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_SetGenericTriggerInput(PASS_EPASS_MMIO_Type * base, uint8_t numOfAdc,
                                                  uint8_t triggerInputNumber, uint8_t genericTriggerValue)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    if ((numOfAdc > PASS_SAR_ADC_NR) ||
        (triggerInputNumber >= CY_SAR2_TR_IN_NUM) ||
        (genericTriggerValue >= CY_SAR2_GEN_TR_IN_NUM))
    {
        ret = CY_SAR2_BAD_PARAM;
    }
    else
    {
        switch(triggerInputNumber)
        {
        case 0U:
            base->SAR_TR_IN_SEL[numOfAdc] = _CLR_SET_FLD32U(base->SAR_TR_IN_SEL[numOfAdc],
                  PASS_EPASS_MMIO_SAR_TR_IN_SEL_IN0_SEL, genericTriggerValue);
            break;
        case 1U:
            base->SAR_TR_IN_SEL[numOfAdc] = _CLR_SET_FLD32U(base->SAR_TR_IN_SEL[numOfAdc],
                  PASS_EPASS_MMIO_SAR_TR_IN_SEL_IN1_SEL, genericTriggerValue);
            break;
        case 2U:
            base->SAR_TR_IN_SEL[numOfAdc] = _CLR_SET_FLD32U(base->SAR_TR_IN_SEL[numOfAdc],
                  PASS_EPASS_MMIO_SAR_TR_IN_SEL_IN2_SEL, genericTriggerValue);
            break;
        case 3U:
            base->SAR_TR_IN_SEL[numOfAdc] = _CLR_SET_FLD32U(base->SAR_TR_IN_SEL[numOfAdc],
                  PASS_EPASS_MMIO_SAR_TR_IN_SEL_IN3_SEL, genericTriggerValue);
            break;
        case 4U:
            base->SAR_TR_IN_SEL[numOfAdc] = _CLR_SET_FLD32U(base->SAR_TR_IN_SEL[numOfAdc],
                  PASS_EPASS_MMIO_SAR_TR_IN_SEL_IN4_SEL, genericTriggerValue);
            break;
        default:
            /* Do nothing. */
            break;
        }
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_SetGenericTriggerOutput
****************************************************************************//**
*
* Configures the generic output trigger selection.
*
* \param base
* The pointer to the PASS instance.
*
* \param numOfAdc
* The ADC channel number
*
* \param triggerOutputNumber
* The generic input trigger number to be set up.
*
* \param genericTriggerValue
* The generic input trigger to be used as a corresponding trigger input number.
*
* \return
* \ref cy_en_sar2_status_t
*
*******************************************************************************/
cy_en_sar2_status_t Cy_SAR2_SetGenericTriggerOutput(PASS_EPASS_MMIO_Type * base, uint8_t numOfAdc,
                                                  uint8_t triggerOutputNumber, uint8_t genericTriggerValue)
{
    cy_en_sar2_status_t ret = CY_SAR2_SUCCESS;

    if ((numOfAdc > PASS_SAR_ADC_NR) ||
        (triggerOutputNumber >= CY_SAR2_TR_OUT_NUM) ||
        (genericTriggerValue >= CY_SAR2_GEN_TR_OUT_NUM))
    {
        ret = CY_SAR2_BAD_PARAM;
    }
    else
    {
        switch(triggerOutputNumber)
        {
        case 0U:
            base->SAR_TR_OUT_SEL[numOfAdc] = _CLR_SET_FLD32U(base->SAR_TR_OUT_SEL[numOfAdc],
                  PASS_EPASS_MMIO_SAR_TR_OUT_SEL_OUT0_SEL, genericTriggerValue);
            break;
        case 1U:
            base->SAR_TR_OUT_SEL[numOfAdc] = _CLR_SET_FLD32U(base->SAR_TR_OUT_SEL[numOfAdc],
                  PASS_EPASS_MMIO_SAR_TR_OUT_SEL_OUT1_SEL, genericTriggerValue);
            break;
        default:
            /* Do nothing. */
            break;
        }
    }

    return ret;
}

/*******************************************************************************
* Function Name: Cy_SAR2_CalculateDieTemperature
****************************************************************************//**
*
* Calculates the internal temperature from ADC core using Vtemp.
* The API is implemented to calculate the temperature from the 2nd order
* equation of sort data with corrected class data. The API will convert sort data
* into [3][3] matrix and class data into [2][2] matrix.
*
* \param VDDARange
* VDDA voltage range, \ref cy_en_sar2_vdda_range_t.
*
* \param adcVtempRawValue
* The ADC counts the raw value of the temperature diode.
*
* \param adcVbgRawValue
* The ADC counts raw value of the Vbg voltage.
*
* \return
* Temperature Value
*
*******************************************************************************/
double Cy_SAR2_CalculateDieTemperature(cy_en_sar2_vdda_range_t VDDARange, uint16_t adcVtempRawValue,
                                                                                                uint16_t adcVbgRawValue)
{
    double tempInDegreeC = 0.0;
    cy_stc_sar2_temp_sflash_data_t adcTempValues;

