RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sar2.c
    /* Note: Temperature data read from sFLASH is multiple of 10. */
    adcTempValues.coldValue = (((double)(-((float)(SFLASH->EPASS_TEMP_TRIM_TEMP_COLDSORT)))) / 10.0);
    adcTempValues.roomValue = ((double)(SFLASH->EPASS_TEMP_TRIM_TEMP_ROOMSORT) / 10.0);
    adcTempValues.hotValue = ((double)(SFLASH->EPASS_TEMP_TRIM_TEMP_HOTCLASS) / 10.0);

    double determinant = 0.0;
    double coefficientMatrixForSort[3][3] = {{0.0},{0.0},{0.0}};

    double sortTempMatrixA[CY_SAR2_TEMP_MATRIX_SIZE][CY_SAR2_TEMP_MATRIX_SIZE];
    double sortTempValueMatrixB[CY_SAR2_TEMP_MATRIX_SIZE][1];
    double sortTempCoefficeintsX[CY_SAR2_TEMP_MATRIX_SIZE] = {0.0};

    double coeffA;
    double coeffB;
    double coeffC;
    double bSqrMin4ac = 0.0;
    double tempRefValue = 0.0;
    double tempScaleValue = 0.0;
    double correctionFactor = 0.0;
    double tempRootPos;
    double tempRootNeg = 0.0;
    double tempRangeOffset = (double) 10; /* relate to +/- 10 degC */
    bool recalculate;

    /***************************************************************************
     * Updates the class and sorts the matrix from the sFLASH values
     **************************************************************************/

    /* Update the sort temperature value matrix A */
    sortTempMatrixA[0][0] = 1.0;
    sortTempMatrixA[0][1] = adcTempValues.coldValue;
    sortTempMatrixA[0][2] = pow(adcTempValues.coldValue, 2.0);
    sortTempMatrixA[1][0] = 1.0;
    sortTempMatrixA[1][1] = adcTempValues.roomValue;
    sortTempMatrixA[1][2] = pow(adcTempValues.roomValue, 2.0);
    sortTempMatrixA[2][0] = 1.0;
    sortTempMatrixA[2][1] = adcTempValues.hotValue;
    sortTempMatrixA[2][2] = pow(adcTempValues.hotValue, 2.0);

    /* Update the sort temperature adc value matrix B */
    sortTempValueMatrixB[0][0] = (double)CY_SAR2_DIODE_COLD(VDDARange);
    sortTempValueMatrixB[1][0] = (double)CY_SAR2_DIODE_ROOM(VDDARange);
    sortTempValueMatrixB[2][0] = (double)CY_SAR2_DIODE_HOT(VDDARange);

    /***************************************************************************
     * Gets the 2nd order coefficient for the sort value matrix
     **************************************************************************/

    /* Get the determinant of sort temperature matrix A */
    for(uint8_t i = 0U; i < CY_SAR2_TEMP_MATRIX_SIZE; i++)
    {
        determinant = determinant + (sortTempMatrixA[0][i]*(sortTempMatrixA[1U][(i+1U)%3U]*sortTempMatrixA[2U][(i+2U)%3U] -
                                                            sortTempMatrixA[1U][(i+2U)%3U]*sortTempMatrixA[2U][(i+1U)%3U]));
    }

    /* Get the inverse of sort temperature matrix A */
    for(uint8_t i = 0U; i < CY_SAR2_TEMP_MATRIX_SIZE; i++)
    {
        for(uint8_t j = 0U; j < CY_SAR2_TEMP_MATRIX_SIZE; j++)
        {
            coefficientMatrixForSort[i][j] = ((sortTempMatrixA[(i+1U)%3U][(j+1U)%3U] * sortTempMatrixA[(i+2U)%3U][(j+2U)%3U]) -
                                    (sortTempMatrixA[(i+1U)%3U][(j+2U)%3U]*sortTempMatrixA[(i+2U)%3U][(j+1U)%3U]))/ determinant;
        }
    }
    for(uint8_t i = 0U; i < CY_SAR2_TEMP_MATRIX_SIZE; i++)
    {
        for(uint8_t j = 0U; j < CY_SAR2_TEMP_MATRIX_SIZE; j++)
        {
            sortTempMatrixA[i][j] = coefficientMatrixForSort[j][i];
        }
    }

    /* Calculate sort temperature coefficient matrix X = (invA)*B */
    for(uint8_t i = 0U; i < CY_SAR2_TEMP_MATRIX_SIZE; i++)
    {
        for(uint8_t j = 0U; j < CY_SAR2_TEMP_MATRIX_SIZE; j++)
        {
            sortTempCoefficeintsX[i] += (sortTempValueMatrixB[j][0]*sortTempMatrixA[i][j]);
        }
    }

    /***************************************************************************
     * Gets the temperature value from the 2nd order equation
     **************************************************************************/

    /* Rearrange the coefficients for the predicted temperature formula */
    coeffA = sortTempCoefficeintsX[2];
    coeffB = sortTempCoefficeintsX[1];
    coeffC = sortTempCoefficeintsX[0];

    /* -40degC -- SORT2, 27degC -- SORT3, 130degC -- CHI and by default reference value is SORT3 */
    tempRefValue = (double)(CY_SAR2_VBG_ROOM(VDDARange));

    do {
        recalculate = false;

        /* Calculate the correction factor (k) to remove the dependency of the ADC on the reference voltage */
        correctionFactor = (tempRefValue) / ((double)(adcVbgRawValue));

        /* Scale the data in raw with k */
        tempScaleValue = (correctionFactor) * ((double)(adcVtempRawValue));

        /* Calculate the predicted temperature */
        bSqrMin4ac = (double) ( pow(coeffB, 2.0)) - (((4.0)*(coeffA))*(coeffC - tempScaleValue));
        CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.3', 2, 'Intentional typecast of bSqrMin4ac to uint32_t ');
        tempRootNeg = ((-coeffB)-((double)sqrtf(bSqrMin4ac))) / ((2.0)*(coeffA));
        tempRootPos = ((-coeffB)+((double)sqrtf(bSqrMin4ac))) / ((2.0)*(coeffA));
        CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.3');
        /* Select the root that lies between the Hot and Cold temperature sort values [-40 degC, 150 degC] */
        if((tempRootPos < (adcTempValues.hotValue)) && (tempRootPos > (adcTempValues.coldValue)))
        {
            /* The temperature value is positive root of the curve */
            tempInDegreeC = tempRootPos;
        }
        else if((tempRootNeg < (adcTempValues.hotValue)) && (tempRootNeg > (adcTempValues.coldValue)))
        {
            /* The temperature value is the negative root of the curve */
            tempInDegreeC = tempRootNeg;
        }
        else
        {
            /* The Apt value is not found */
            tempInDegreeC = 0.0;
        }

        /* Check for the close proximity of calculated temperature with the reference temperature values */
        if (tempInDegreeC <= ((adcTempValues.coldValue) + tempRangeOffset))
        {
            /* Use the SORT2 value to scale the measured temperature */
            tempRefValue = (double)(CY_SAR2_VBG_COLD(VDDARange));
            recalculate = true;
        }
        else if (tempInDegreeC >= ((adcTempValues.hotValue) - tempRangeOffset))
        {
            /* Use the CHI value to scale the measured temperature */
            tempRefValue = (double)(CY_SAR2_VBG_HOT(VDDARange));
            recalculate = true;
        }
        else if ((tempInDegreeC <= ((adcTempValues.roomValue) + tempRangeOffset))
            && (tempInDegreeC >= ((adcTempValues.roomValue) - tempRangeOffset)))
        {
            /* Use the SORT3 value to scale the measured temperature */
            tempRefValue = (double)(CY_SAR2_VBG_ROOM(VDDARange));
        }
        else
        {
            /* Do nothing */
        }
    } while (recalculate == true);

    return tempInDegreeC;
}

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');

#endif /* CY_IP_MXS40EPASS_ESAR */
